import React from 'react';
import { Container } from 'react-bootstrap';

const ChildhoodScreen = () => {
  return (
    <>
      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>مرحلة الطفولة المبكرة  <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>أثناء مرحلة الرضاعة والطفولة المبكرة يتوجه اهتمام أسرة الطفل نحو صحته ونموه، وتطور المعالم الأساسية لحركته الجسدية، وتفاعله الاجتماعي، واهتمامه بما يجري من حوله من أحداث، أصوات كلامه وردوده المبكرة. ففي هذه المرحلة قد يشارك أخصائي العلاج الوظيفي في</p>
          <p>التعامل مع مشاكل التغذية المتعلقة بالمهارات الحركية للفم، نظرا لارتخاء وضعف عضلات الخدين واللسان والشفاه تصعب الرضاعة على الأطفال المصابين بمتلازمة داون. فيقوم المعالج الوظيفي باقتراح وضعيات جسدية واساليب للتغذية</p>
          <p>المساعدة على تيسير تطور المعالم الأساسية لحركة الطفل الجسدية، وبالتحديد المهارات الحركية الدقيقة</p>
          <p>أيضًا يعمل أخصائي العلاج الوظيفي مع أخصائي العلاج الطبيعي بشكل وثيق لمساعدة الطفل على تطوير معالم مهاراته الحركية الكبرى (مثل:الجلوس، الحبو أو الزحف، الوقوف، المشي). ففي هذه المرحلة يقوم بتعزيز حركات الذراع واليد التي تضع الأساس لتنمية المهارات الحركية الدقيقة لاحقا.</p>
          <p>ارتخاء عضلات الطفل وأربطة مفاصله هي من التحديات التي تواجه تطور المعالم الحركية المبكرة للطفل المصاب بمتلازمة داون، فيقوم أخصائي العلاج الوظيفي بمساعدته على مواجهة تلك التحديات.</p>
        </Container>
      </section>

      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>مرحلة ما قبل المدرسة <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>وعندما يكون الطفل في عمر ما قبل المدرسة فهو بأغلب الظن سيكون قادر على التنقل باستقلال وسيصبح مشغول باستكشاف بيئته، لمساعدة تنميته من الأفضل ان تزوده بفرص كثيرة للتعلم وأن تشجع الخطوات البدائية في تعليمه كيف يطعم ويلبس نفسه وأن يتعلم اللعب بشكل مناسب ويتفاعل مع أطفال آخرين، تشجيع مهارات الحديث واللغة وتزوديه بفرص لتحسين إجمالي للمهارات الحركية. في هذه المرحلة قد يتدخل المعالج الوظيفي لـ</p>
          <p>تسهيل تطور المهارات الحركية الدقيقة: هذه مرحلة مهمة في نمو المهارات الحركية الدقيقة لدى من أطفال متلازمة داون. في هذه المرحلة يبدأ الأطفال بتطوير الحركة في أياديهم ليتمكنوا من عمل أشياء عديدة في مراحل حياتهم اللاحقة، ولكن في العديد من الحالات يحتاج الأطفال إلى علاج وظيفي لتأكيد حصول هذا التطور الحركي. يستطيع الأطفال تحقيق هذا من خلال اللعب؛ فتح وغلق الأشياء، التقاط وفك الألعاب من شتى الأشكال والأحجام، التكديس والبناء، التلاعب بمقابض وأزرار لعبة ما، التلوين بالألوان الشمعية، إلخ. قد يواجه الطفل الذي يعاني من متلازمة داون بعض التحديات الإضافية عند تعلم مهاراته الحركية الدقيقة نتيجة ضمور بالعضلات ونقص في مرونة أربطة المفاصل.</p>
          <p>تعزيز بدايات مراحل مهارات المساعدة الذاتية: المعالج الوظيفي يستطيع مساعدة أبوي الطفل المولود بمتلازمة داون على تبسيط هذه المهارات وبالتالي تصبح توقعاتهم من طفلهم ملائمة أكثر، كما يمكنه اقتراح وضعيات مناسبة للطفل تساعده على التأقلم مع حالته وتمكنه من الاعتماد على نفسه قدر الإمكان عند ممارسة هذه المهارات. وهذا يشمل توفير المعدات المساعدة المناسبة. مثلا: استخدام صحن مخصص أو ملعقة مخصصة ستساعد الطفل على الاعتماد على نفسه عند الأكل.</p>
        </Container>
      </section>

      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>مرحلة الدخول للمدرسة <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>عندما يدخل الطفل في المدرسة، يمكن مساعدة الطفل على التكيف مع العادات الجديدة، وحضور اجتماعات المدرسة لتخطيط برامج تعليمية للطفل، يجب التركيز على الكلام والتواصل، ويمكن مساعدة الطفل في ممارسة المهارات الحركية الدقيقة للأطفال (مثل تعلم الطباعة)، وترقب الطفل للمزيد من التطور والاستقلال في أنشطة المساعدة الذاتية، والبحث في الأنشطة اللامنهجية التي من شأنها أن تعرض الطفل لمجموعة متنوعة من الخبرات الاجتماعية والتعليمية والمادية.

في هذه المرحلة يكون العلاج الوظيفي مقسم إلى</p>
          <p>العمل على تيسير تنمية المهارات الحركية الدقيقة في الفصول الدراسية، العديد من أخصائي العلاج الوظيفي يعملوا في نظام المدرسة وتوفير برامج لمساعدة أطفال «متلازمة داون» على التعلم والطباعة، والكتابة اليدوية والكتابة على الآلة الكاتبة، والتقطيع... إلخ. يجب النظر أيضا في تحديد المواقع الفيزيائية لتحقيق الأداء الأمثل (على سبيل المثال: حجم المكتب إلخ) والمساعدة في تكييف وتيسير برنامج يقوم على قدرات الطفل الجسدية</p>
          <p>تيسير مهارات المساعدة الذاتية في المنزل أو في المدرسة. كما هو الحال مع جميع الأطفال، فالأطفال الذين يعانون من متلازمة داون يختلفون في السمات، والمزاج، ودوافع الاستقلال. بعض الأطفال الذين يعانون من «متلازمة داون» لديهم الرغبة في فعل الأشياء بأنفسهم، مثل اللباس وإطعام أنفسهم. قد يكونون هؤلاء الأطفال تعلموا هذه المهارات من خلال مشاهدة الآخرين ومشاركتهم من سن مبكر، وعلى صعيدٍ آخر يسعد بعض الأطفال بمساعدة الآخرين لهم في أداء بعض أمورهم، ومقاومة المحاولات قد تكون جيدة لمساعدتهم على تعلم هذه المهارات. في هذه الحالات قد يكون العلاج الوظيفي قادر على مساعدة الوالدين للعمل على هذه التحديات والصعوبات، بينما يساعد أيضاً على نمو وتطوير مهارات الطفل الحركية ليكون قادراً على أداء المهمات الذاتية بنجاح</p>
          <p>معالجة أي احتياجات حسية قد يعاني منها الطفل، في بعض الأحيان يتساءل أحد الوالدين عن أشياء قد يفعلها الطفل قد تكون مرتبطة بنمو الطفل الحسي على سبيل المثال، قد يفرط الطفل في وضع الألعاب في فمه، قد يكون يعاني من ضعف ادراك جسده في المكان، أو قد يعاني من الضغط بقوة على الأشياء أو رميها بكثرة، أو قد لا يتعامل مع بعض الأشياء الروتينية بشكل جيد مثل غسل ومشط الشعر، وهنا يستطيع العلاج الوظيفي أن يقدم اقتراحات لمساعدة الطفل والوالدين على التعامل مع هذه القضايا</p>
        </Container>
      </section>
    </>
  )
}

export default ChildhoodScreen;
