import React from 'react';
import { Container } from 'react-bootstrap';

const EducationAndFamilyScreen = () => {
  return (
    <>
      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>ماذا على الأهل أن يفعلوا؟  <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>لكي يقوم الأهل بالخطوات الصحيحة الأنسب لطفلهم يتوجب عليهم أن</p>
          <p>يتعلموا كل ما يخص متلازمة داون، فذلك سيساعدهم على ملاءمة توقعاتهم للواقع كما يفيدهم في كيفية تقديم المساعدة لطفلهم *</p>
          <p>التحري حول حقهم في الحصول على أي دعم مادي *</p>
          <p>التحري حول وسائل الدعم في المنطقة السكنية التي يقطنون فيها مثلًا في الكثير من الأماكن تتوفر برامج مساعدة وعلاج للأطفال دون سن الثالثة لكي تؤمن لهم المساعدة في بداية طريقهم وتساهم في دفعهم قدمًا *</p>
          <p>التحري حول مؤسسات ثقافية ملائمة لإيجاد إطار تعليمي مناسب *</p>
          <p>إن تربية طفل مصاب بمتلازمة داون هو تحدٍ صعب لكنه يأتي بثوابٍ كبير، يجب على الأهل أن يكرسوا لأنفسهم بعض الوقت وإن احتاجوا مساعدة فعليهم ألا يترددوا في طلبها *</p>
          <p>إن تبادل الأحاديث والتجارب مع أهالي آخرين لديهم طفل مصاب بمتلازمة داون من شأنه أن يشكل عاملًا مساعدًا في علاج متلازمة داون، لذلك يمكن الاستفسار من الطبيب أو من مؤسسة صحية عن مجموعات الدعم لأهالي الأطفال الذين يعانون من متلازمة داون *</p>
        </Container>
      </section>

      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>وسائل تعليمية لمرضي متلازمة داون <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>يساعد إنشاء روتين ثابت على تطوير مهارات وتحسين فرص تعلم المرضى المصابين بمتلازمة داون، وقد يتعلم المريض أشياء أكثر مما يظهر، وتشمل الوسائل التعليمية لمرضى متلازمة داون على ما يلي</p>
          <p>يتمتع الأشخاص المصابين بمتلازمة داون بالقدرة على التعلم البصري  بشكل قوي، مما يعني أن استخدام الصور والرسوم والعروض التوضيحية المرئية يوفر فرصة فعالة لتعلم المريض.</p>
          <p>استخدام التعليم الصوتي</p>
          <p>استخدام الوسائل اليدوية، وتحفيز المريض على الاكتشاف بمفرده  لتطوير مفاهيم الأرقام، وقد يزيد استخدام التعليم المرئي من سرعة وقدرة المريض على تعلم الأرقام.</p>
          <p>لدى مرضى متلازمة داون مهارات اجتماعية  جيدة، لذا يمكن استخدام هذه المهارات بشكل بناء لزيادة فرص تعلم المريض من خلال الانخراط في أداء نشاطات تعليمية مع الطلاب الآخرين.</p>
          <p>تجذب العروض والنشاطات التي تنطوي على اللمس  العديد من المرضى المصابين بمتلازمة داون.</p>
          <p>التحدث إلى المريض بشكل مباشر باستخدام لغة واضحة وجمل قصيرة ، واستخدام  ملامح وجه مناسبة  لا تسبب الارتباك</p>
          <p>عدم تقديم الدعم والمساعدة بشكل مفرط  للمريض، لأن مرضى متلازمة داون قد يصبحوا معتمدين  بشكل غير ضروري على الآخرين.</p>
        </Container>
      </section>
      
      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>طرق دمج مرضى متلازمة داون مع الوسائل التعليمية <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>وضع مخطط واحد وواضح  للدروس والمهارت التي سيتعلمها المريض يتضمن على المهام التي سيؤديها مريض متلازمة داون.</p>
          <p>دمج  وتضمين المريض في جميع مراحل الدرس</p>
          <p>مراقبة أداء  مريض متلازمة داون في صفه.</p>
          <p>إعطاء المرونة للمعلمين  لتعديل طرق التعلم  وفقاً لحاجات الطلاب المصابين بمتلازمة داون.</p>
          <p>إجراء تعديلات على المهام والواجبات  التي سيقوم بها المريض، بما يتناسب مع القدرات العقلية لمرضى متلازمة داون</p>
          <p>إظهار المتعة في التدريس والتحدث  بمودة عن المريض.</p>
        </Container>
      </section>
    </>
  )
}

export default EducationAndFamilyScreen;
