import React from 'react';
import { Container } from 'react-bootstrap';

const SymptomsAndCausesScreen = () => {
  return (
    <>
      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>الأعراض <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>كل شخص مصاب بمتلازمة داون هو فرد يعاني مشكلات عقلية ونمائية خفيفة أو معتدلة أو شديدة. قد يكون البعض أصحّاء بينما البعض الآخر يعانون مشكلات صحية كبيرة كتشوهات خطيرة في القلب</p>
          <p>يتميز الأطفال والبالغون المصابون بمتلازمة داون بملامح وجه مميزة. بالرغم من أن جميع المصابين بمتلازمة داون لا يمتلكون نفس ملامح الوجه، فإن أبرز الملامح تتضمن</p>
          <p>الوجه المسطح</p>
          <p>الرأس الصغير</p>
          <p>الرقبة القصيرة</p>
          <p>اللسان البارز</p>
          <p>الجفون المائلة إلى الأعلى (شقوق جفنية)</p>
          <p>أذنين بشكل غريب أو صغيرتين</p>
          <p>توتر عضلات ضعيف</p>
          <p>يدين عريضتين قصيرتين بتجعيد واحد في كف اليد</p>
          <p>أصابع قصيرة نسبيًا ويدين ورجلين صغيرتين</p>
          <p>مرونة مفرطة</p>
          <p>نقاطًا بيضاء صغيرة على الجزء الملون (القزحية) من العين تدعى بقع بروشفيلد</p>
          <p>قصرالطول</p>
          <p>قد يمتلك الأطفال المصابون بمتلازمة داون جسمًا عاديًا ولكنهم ينمون بشكل أبطأ ويظلون أقصر عن غيرهم من الأطفال بنفس العمر.</p>
          <p>يعاني معظم الأطفال المصابين بمتلازمة داون من ضعف إدراكي معتدل إلى متوسط. تأخر اللغة، وتأثر كل من الذاكرة القصيرة والطويلة الأجل</p>
        </Container>
      </section>

      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>الأسباب <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>عادة ما تحتوي الخلايا البشرية على 23 زوجًا من الكروموسومات. ويأتي كروموسوم واحد في كل زوج من الأب والآخر من الأم</p>
          <p>تنتج متلازمة داون عند حدوث انقسام خلوي غير طبيعي يتعلق بالكروموسوم 21. ينتج عن انقسام الخلايا غير الطبيعية وجود نسخة كلية أو جزئية إضافية من الكروموسوم 21. تكون المادة الجينية الإضافية مسؤولة عن السمات المميزة ومشاكل في النمو متعلقة بمتلازمة داون. يمكن أن تتسبب واحدة من الاختلافات الجينية الثلاثة التالية في الإصابة بمتلازمة داون</p>
          <p>تثلث الصبغي 21. في 95% من الحالات، تحدث الإصابة بمتلازمة داون بسبب تثلث الصبغي 21 حيث يكون لدى الطفل ثلاث نسخ من الكروموسوم 21 في كل الخلايا بدلاً من نسختين كالمعتاد. يحدث هذا بسبب انقسام الخلية غير الطبيعي أثناء نمو الخلية المنوية أو خلية البويضة</p>
          <p>متلازمة داون الفسيسائية. في هذا الشكل النادر من متلازمة داون، يكون لدى الشخص بعض الخلايا فقط التي تحتوي على نسخ إضافية من الكروموسوم 21. يحدث هذا المزيج الفسيفسائي من الخلايا الطبيعية والشاذة بسبب انقسام الخلية بشكل غير طبيعي بعد التخصيب</p>
          <p>متلازمة داون بالتبدل الصبغي. يمكن أن تحدث متلازمة داون عندما يصبح جزء من كروموسوم 21 متصلاً (تم تغيير موضعه) بكروموسوم آخر، قبل الحمل أو خلاله. يكون لدى هؤلاء الأطفال النسختان المعتادتان من الكروموسوم 21، ولكن لديهم أيضًا مواد وراثية إضافية من الكروموسوم 21 مرتبطة بكروموسوم آخر</p>
          <p>لا يوجد أي عوامل سلوكية أو بيئية معروفة تتسبب في الإصابة بمتلازمة داون</p>
        </Container>
      </section>

      <section>
        <Container className='bg-light py-3'>
          <h3 className='py-3' style={{textAlign: 'right', borderBottom: '2px solid #2196f3'}}>هل المرض وراثي؟ <i className="fa-solid fa-hand-point-left"></i></h3>
          <p>وفي أغلب الأحيان، لا تكون متلازمة داون موروثة. وقد تنجم عن خطأ في انقسام الخلايا خلال مراحل النمو الأولى للجنين.</p>
          <p>وقد تنتقل متلازمة داون بالتبدل الصبغي من الآباء إلى الطفل. ومع ذلك، يعاني حوالي من 3 إلى 4 بالمئة من الأطفال المصابين بمتلازمة داون بالتبدل الصبغي وورثها البعض من أحد الوالدين</p>
          <p>وعندما يرث الأبناء مرض التبدل الصبغي المتوازن، يوجد لدى الأم أو الأب بعض المواد الجينية المُعاد ترتيبها من كرموسوم رقم 21 عن كرموسوم آخر، وتٌعتبر هذه المواد ليست مواد جينية إضافية. وهذا يعني أن الناقل المتوازن لا يعاني أي علامات أو أعراض لمتلازمة داون، ولكن يمكن أن ينقل الأب أو الأم التبدل الصبغي غير المتوازن إلى الأبناء مما يؤدي إلى إصابة الأطفال بمتلازمة داون</p>
        </Container>
      </section>
    </>
  )
}

export default SymptomsAndCausesScreen;
